###############################################################################
# HOW TO USE THIS FILE:
#   Install homebrew-bundle with `brew tap Homebrew/bundle`
#   then `brew bundle --verbose` where the Brewfile is located.
###############################################################################

tap "homebrew/versions"
tap "homebrew/science"
tap "homebrew/games"

# Applications
brew "graphviz"
brew "ckan" # KSP mod manager
brew "irssi"
# brew "syncthing"

# Shell utilities
brew "coreutils" # Adds `realpath` and other commands
brew "zsh"
brew "exa"
brew "tree"
brew "tmux"
brew "git"
brew "tig"
brew "git-flow"
brew "midnight-commander"
brew "unar"
brew "unrar"
brew "p7zip"
brew "ack"
brew "jq"
brew "jsonpp"
brew "htop-osx"
brew "pstree"
brew "netcat"
brew "nmap"
brew "ngrep"
brew "wget"
brew "watch"
brew "protobuf"
brew "awscli"
brew "tesseract"
brew "libsass"
brew "fswatch"
brew "shellcheck" # for linter-shellcheck Atom plugin
brew "exiftool"

# Development dependencies
brew "ruby-build"
brew "phantomjs"
brew "imagemagick"
brew "reattach-to-user-namespace" # for tmux
brew "yarn"

# Databases
brew "postgresql"
brew "sqlite"
brew "ipfs"

# Cluster stuff
brew "apache-spark"
brew "kubernetes-cli"
# brew "kafka"

# Languages
brew "rbenv"
brew "node"
brew "rust"
brew "go"
brew "leiningen" # Clojure
brew "python3"
brew "R"
brew "scala"
brew "sbt"

# Editors
brew "emacs"
brew "vim"

# Crypto
brew "openssl"
brew "libsodium"
brew "pass"
brew "gpgme"
