###############################################################################
# HOW TO USE THIS FILE:
#   Install homebrew-bundle with `brew tap Homebrew/bundle`
#   then `brew bundle --verbose` where the Brewfile is located.
###############################################################################

tap "neovim/neovim"
tap "homebrew/versions"
tap "homebrew/science"

# Applications
brew "graphviz"
#brew "syncthing"

# Shell utilities
brew "coreutils" # Adds `realpath` and other commands
brew "zsh"
brew "tree"
brew "tmux"
brew "git"
brew "tig"
brew "git-flow"
brew "midnight-commander"
brew "unar"
brew "unrar"
brew "p7zip"
brew "ack"
brew "jq"
brew "jsonpp"
brew "htop-osx"
brew "netcat"
brew "nmap"
brew "ngrep"
brew "wget"
brew "watch"
brew "protobuf"
brew "awscli"
brew "tesseract"
brew "libsass"
brew "fswatch"
brew "shellcheck" # for linter-shellcheck Atom plugin

# Development dependencies
brew "ruby-build"
brew "qt55" # for capybara-webkit
brew "phantomjs"
brew "watchman"
brew "imagemagick"
brew "reattach-to-user-namespace" # for tmux
brew "heroku"
brew "typesafe-activator"

# Databases
brew "postgresql"
brew "sqlite"
brew "neo4j"
brew "orientdb"
brew "leveldb"
brew "influxdb"
brew "ipfs"

# Cluster stuff
brew "apache-spark"
brew "kafka"
brew "kubernetes-cli"

# Languages
brew "rbenv"
brew "node"
brew "rust"
brew "go"
brew "leiningen" # Clojure
brew "python"
brew "R"
brew "scala"
brew "sbt"
brew "thrift"

# Editors
brew "emacs"
brew "macvim"
brew "neovim"

# Crypto
brew "openssl"
brew "libsodium"
brew "keybase"
#brew "openssh" # Package removed?
#brew "ethereum" # Package removed?

