###############################################################################
# HOW TO USE THIS FILE:
#   Install homebrew-bundle with `brew tap Homebrew/bundle`
#   Simply run `brew bundle -v` where the Brewfile is located.
###############################################################################

tap "neovim/neovim"

# Shell utilities
brew "zsh"
brew "tmux"
brew "git"
brew "tig"
brew "git-flow"
brew "coreutils" # Adds `realpath` and other commands
brew "midnight-commander"
brew "unzip"
brew "unrar"
brew "p7zip"
brew "ack"
brew "jsonpp"
brew "htop-osx"
brew "netcat"
brew "nmap"
brew "wget"
brew "watch"

# Development dependencies
brew "phantomjs"
brew "watchman"
brew "graphviz"
brew "imagemagick"
brew "osxfuse"
brew "reattach-to-user-namespace" # for tmux

# Databases
brew "sqlite"
brew "postgresql"
brew "leveldb"

# Languages
brew "node"
brew "rust"
brew "go"
brew "leiningen" # Clojure
brew "python"

# Editors
brew "emacs"
brew "neovim"

# Crypto
brew "openssl"
brew "openssh"
brew "libsodium"
brew "ethereum"
brew "keybase"

# Amusement
brew "dwarf-fortress"
